<template>
  <div class="agreement">
    <div class="page-wrap">
      <div class="page-title">
        <a @click="routerBack"><i class="icon-back"></i></a>
        <span>竞拍APP用户协议</span>
      </div>

      <div class="page-content">
        <div class="agreement-content">
          <mt-cell title="平台服务协议"></mt-cell>
          <h3>【导言】</h3>
          <article>
            欢迎访问{{$const.TITLE}}平台，申请使用{{$const.TITLE}}平台团队提供的竞拍平台服务（以下简称“竞拍平台”），请您（下列简称为“用户”）仔细阅读以下全部内容（特别是粗体下划线标注的内容）。如用户不同意本服务条款任意内容，请勿注册或使用竞拍平台。如用户通过进入注册程序并勾选“我同意竞拍平台服务协议”，即表示用户与竞拍平台团队已达成协议，自愿接受本服务条款的所有内容。此后，用户不得以未阅读本服务条款内容作任何形式的抗辩。
          </article>
          <h3>【用户使用竞拍平台的前提条件】</h3>
          <article>
            用户在使用竞拍平台时须具备相应的权利能力和行为能力，能够独立承担法律责任，如果用户在18周岁以下，必须在父母或监护人的监护参与下才能使用本站。
          </article>
          <h3>【用户管理】</h3>
          <article>
            1、用户ID 用户首次登录竞拍平台时，竞拍平台会为每位用户生成一个帐户ID，作为其使用竞拍平台服务的唯一身份标识，用户需要对其帐户项下发生的所有行为负责。
            <br/><br/> 2、用户资料完善 用户应当在使用竞拍平台时完善个人资料，用户资料包括但不限于个人手机号码或收货地址、帐号名称、头像、密码、注册或更新竞拍平台团队邮箱帐号时输入的所有信息。 用户在完善个人资料时承诺遵守法律法规、社会主义制度、国家利益、公民合法权益、公共秩序、社会道德风尚和信息真实性等七条底线，不得在资料中出现违法和不良信息，且用户保证其在完善个人资料和使用帐号时，不得有以下情形：
            <br/> （1）违反宪法或法律法规规定的；
            <br/> （2）危害国家安全，泄露国家秘密，颠覆国家政权，破坏国家统一的；
            <br/> （3）损害国家荣誉和利益的，损害公共利益的；
            <br/> （4）煽动民族仇恨、民族歧视，破坏民族团结的；
            <br/> （5）破坏国家宗教政策，宣扬邪教和封建迷信的；
            <br/> （6）散布谣言，扰乱社会秩序，破坏社会稳定的；
            <br/> （7）散布淫秽、色情、赌博、暴力、凶杀、恐怖或者教唆犯罪的；
            <br/> （8）侮辱或者诽谤他人，侵害他人合法权益的；
            <br/> （9）含有法律、行政法规禁止的其他内容的。
            <br/> 若用户提供给竞拍平台团队的资料不准确，不真实，含有违法或不良信息的，竞拍平台团队有权不予完善，并保留终止用户使用竞拍平台的权利。若用户以虚假信息骗取帐号ID或帐号头像、个人简介等注册资料存在违法和不良信息的，有权采取通知限期改正、暂停使用、注销登记等措施。对于冒用关联机构或社会名人注册帐号名称的，竞拍平台团队有权注销该帐号，并向政府主管部门进行报告。
            <br/> 根据相关法律、法规规定以及考虑到竞拍平台服务的重要性，用户同意：
            <br/> （1）在完善资料时提交个人有效身份信息进行实名认证；
            <br/> （2）提供及时、详尽及准确的用户资料；
            <br/> （3）不断更新用户资料，符合及时、详尽准确的要求，对完善个人资料时填写的身份证件信息不能更新。
            <br/><br/> 3、拍币
            <br/> （1）用户充值可获得对应的拍币，所得拍币和赠币均只能用于本平台消费，一般情况下不予提现及退换，请确认后充值。
            <br/> （2）拍币必须通过竞拍平台团队提供或认可的平台获得，从非竞拍平台团队提供或认可的平台所获得的拍币将被认定为来源不符合本服务协议。
            <br/> （3）拍币不能用于购买或兑换其它竞拍平台团队收费服务或者转移给其他用户。
            <br/><br/> 4、用户应当保证在使用竞拍平台的过程中遵守诚实信用原则，不扰乱竞拍平台的正常秩序，不得通过使用他人帐户、一人注册多个帐户、使用程序自动处理等非法方式损害他人或竞拍平台团队的利益。
            <br/><br/> 5、若用户存在任何违法或违反本服务协议约定的行为，竞拍平台团队有权视用户的违法或违规情况适用以下一项或多项处罚措施：
            <br/> （1）责令用户改正违法或违规行为；
            <br/> （2）中止、终止部分或全部服务；
            <br/> （3）取消用户商品订单并取消商品发放（若用户已获得商品）， 且用户已获得的拍币不予退回；<br/> （4）冻结或注销用户帐号及其帐号中的拍币（如有）；
            <br/> （5）其他竞拍平台团队认为合适在符合法律法规规定的情况下的处罚措施。
            <br/> 若用户的行为造成竞拍平台团队及其关联公司损失的，用户还应承担赔偿责任。
            <br/><br/> 6、若用户发表侵犯他人权利或违反法律规定的言论，竞拍平台团队有权停止传输并删除其言论、禁止该用户发言、注销用户帐号及其帐号中的拍币（如有），同时，竞拍平台团队保留根据国家法律法规、相关政策向有关机关报告的权利。
          </article>
          <h3>【竞拍平台的规则】</h3>
          <article>
            1、释义<br/> （1）拍币：指竞拍平台用于竞拍的虚拟货币，每1拍币价值1元。
            <br/> （2）初始价：即最低成交价，竞拍平台所有商品0元起。
            <br/> （3）成交价格：当计时器为零时，该商品的竞拍价格为最终成交价格
            <br/><br/> 2、竞拍平台团队承诺遵循公平、公正、公开的原则运营竞拍平台，确保所有用户在竞拍平台中享受同等的权利与义务，竞拍结果向所有用户公示。
            <br/><br/> 3、用户知悉，除本协议另有约定外，无论是否获得竞拍成功，用户用于参与竞拍平台的拍币不能全额退回；其完全了解参与竞拍平台活动的存在的风险，深圳市竞拍平台精灵网络技术有限公司不保证用户参与竞拍平台一定会获得商品。
            <br/><br/> 4、用户通过参与竞拍平台竞拍成功后，应在3天内登陆竞拍平台下单购买，否则视为放弃该商品，用户因此行为造成的损失，竞拍平台团队不承担任何责任。
            <br/><br/> 5、用户通过参与竞拍平台获得的商品，享受该商品生产厂家提供的三包服务，具体三包规定以该商品生产厂家公布的为准。
            <br/><br/> 6、如果下列情形发生，竞拍平台团队有权取消用户竞拍订单：
            <br/> （1）因不可抗力、竞拍平台系统发生故障或遭受第三方攻击，或发生其他竞拍平台团队无法控制的情形；
            <br/> （2）根据竞拍平台团队已经发布的或将来可能发布或更新的各类规则、公告的规定，竞拍平台团队有权取消用户订单的情形。 竞拍平台团队有权取消用户订单后，用户可申请退还拍币，所退拍币将在3个工作日内退还至用户帐户中。
            <br/><br/>
          </article>
          <h3>【本服务协议的修改】</h3>
          <article>
            用户知晓竞拍平台团队不时公布或修改的与本服务协议有关的其他规则、条款及公告等是本服务协议的组成部分。竞拍平台团队有权在必要时通过在竞拍平台内发出公告等合理方式修改本服务协议，用户在享受各项服务时，应当及时查阅了解修改的内容，并自觉遵守本服务协议。用户如继续使用本服务协议涉及的服务，则视为对修改内容的同意，当发生有关争议时，以最新的服务协议为准；用户在不同意修改内容的情况下，有权停止使用本服务协议涉及的服务。<br/><br/> 我们不会向任何第三方提供，出售，出租，分享和交易用户的个人信息。当在以下情况下，用户的个人信息将部分或全部被善意披露：

            <br/> 1、经用户同意，向第三方披露； <br/> 2、如用户是合资格的知识产权投诉人并已提起投诉，应被投诉人要求，向被投诉人披露，以便双方处理可能的权利纠纷；
            <br/> 3、根据法律的有关规定，或者行政或司法机构的要求，向第三方或者行政、司法机构披露；
            <br/> 4、如果用户出现违反中国有关法律或者网站政策的情况，需要向第三方披露；
            <br/> 5、为提供你所要求的产品和服务，而必须和第三方分享用户的个人信息；
            <br/> 6、其它本站根据法律或者网站政策认为合适的披露。
            <br/>

          </article>
          <article>
            如用户对本规则内容有任何疑问，可拨打客服电话进行咨询。
          </article>
          <h3>特别声明 </h3>
          <article>
            通过本软件所从事的任何活动及其获得的任何商品均与苹果公司（Apple Inc.）无关。苹果公司既不以赞助商也不以其他任何方式参与。
          </article>
        </div>

      </div>
    </div>
  </div>
</template>

<script scoped>
  export default {
    name: 'agreement',
    data () {
      return {}
    },
    methods: {
      routerBack () {
        this.$router.go(-1)
      }
    }
  }
</script>

<style>
  .agreement-content{
    display: block;
  }
  .agreement-content .mint-cell-title{
    font-weight: 700;
    text-align: center;
  }
  .agreement-content h3{
    color:#ef0000;
    font-size: 14px;
    padding:10px 0;
    text-align: center;
  }
  .agreement-content article{
    text-align: left;
    margin-bottom: 10px;
    font-size: 14px;
    color:#333333;
    padding:10px;
    background-color:#ffffff;
    border-top:1px solid #f2f2f2;
  }
</style>
